Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКиЗГИСМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EPCGTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГИСМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СерииНоменклатуры/Ext/ManagerModule.bsl
Функция СерииНоменклатурыИспользуются() Экспорт
	
	Счет41 = ПланыСчетов.Учетный.Счет41();
	Используется = Ложь;
	Для каждого ТекСубконто Из Счет41.ВидыСубконто Цикл
		Если ТекСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Серии номенклатуры", Истина) Тогда
			Используется = Истина;		
		КонецЕсли;
	КонецЦикла;
	
	Счет41 = ПланыСчетов.Учетный.Счет43();
	Для каждого ТекСубконто Из Счет41.ВидыСубконто Цикл
		Если ТекСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Серии номенклатуры", Истина) Тогда
			Используется = Истина;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Используется;
	
КонецФункции // ()

Функция СоздатьПолучитьСерию(Владелец, ДатаПроизводства, СрокГодности = Неопределено, ГоденДо = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Владелец = &Владелец
	|	И НАЧАЛОПЕРИОДА(СерииНоменклатуры.ДатаПроизводства, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаПроизводства, ДЕНЬ)
	|	И (СерииНоменклатуры.ГоденДо = &ГоденДо
	|			ИЛИ СерииНоменклатуры.ГоденДо = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ДатаПроизводства", ДатаПроизводства);
	Запрос.УстановитьПараметр("ГоденДо", ГоденДо);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		НоваяСерия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		НоваяСерия.Владелец = Владелец;
		НоваяСерия.ДатаПроизводства = ДатаПроизводства;
		НоваяСерия.СрокГодности = СрокГодности;
		НоваяСерия.ГоденДо = ГоденДо;
		НоваяСерия.Наименование = Формат(ДатаПроизводства, "ДФ=dd.MM.yyyy");
		НоваяСерия.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат НоваяСерия.Ссылка;
	КонецЕсли;
	
КонецФункции // ()


Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НомерСерии = Данные.Ссылка.Номер;
	Представление = ?(ЗначениеЗаполнено(Данные.Ссылка.ДатаПроизводства), Формат(Данные.Ссылка.ДатаПроизводства,"ДФ=dd.MM.yyyy"), Данные.Ссылка.Наименование) + ?(НомерСерии = "", "", " (" + НомерСерии + ")");
КонецПроцедуры


Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	Запрос = Новый Запрос;
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Если ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СерииНоменклатуры.Ссылка КАК Ссылка,
			|	СерииНоменклатуры.Представление КАК Представление,
			|	СерииНоменклатуры.ДатаПроизводства КАК ДатаПроизводства
			|ИЗ
			|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			|ГДЕ
			|	СерииНоменклатуры.Владелец = &Владелец
			|	И (СТРОКА(СерииНоменклатуры.ДатаПроизводства) ПОДОБНО &СтрокаПоиска
			|			ИЛИ СерииНоменклатуры.Номер ПОДОБНО &СтрокаПоиска)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаПроизводства";  
			Запрос.УстановитьПараметр("Владелец", Параметры.Отбор.Владелец); 
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СерииНоменклатуры.Ссылка КАК Ссылка,
			|	СерииНоменклатуры.Представление КАК Представление,
			|	СерииНоменклатуры.ДатаПроизводства КАК ДатаПроизводства
			|ИЗ
			|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			|ГДЕ
			|	(СТРОКА(СерииНоменклатуры.ДатаПроизводства) ПОДОБНО &СтрокаПоиска
			|			ИЛИ СерииНоменклатуры.Номер ПОДОБНО &СтрокаПоиска)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаПроизводства";
		КонецЕсли;	
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СерииНоменклатуры.Ссылка КАК Ссылка,
		|	СерииНоменклатуры.Представление КАК Представление,
		|	СерииНоменклатуры.ДатаПроизводства КАК ДатаПроизводства
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	(СТРОКА(СерииНоменклатуры.ДатаПроизводства) ПОДОБНО &СтрокаПоиска
		|			ИЛИ СерииНоменклатуры.Номер ПОДОБНО &СтрокаПоиска)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПроизводства";
	КонецЕсли;
	Запрос.УстановитьПараметр("СтрокаПоиска", СокрЛП(Параметры.СтрокаПоиска)+"%"); 
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ДанныеВыбора = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
	КонецЦикла;
	
	Для каждого СтрокаВыбора Из ДанныеВыбора Цикл
		СтрокаВыбора.Представление = ВернутьФорматированнуюСтрокуПоиска(СтрокаВыбора.Представление,Параметры.СтрокаПоиска);
	КонецЦикла;
	
КонецПроцедуры 

Функция ВернутьФорматированнуюСтрокуПоиска(СтрокаДляРазбора,СтрокаПоиска) Экспорт
	
	СтрокаЗамены = "";
	Для стр = 1 По СтрДлина(СтрокаПоиска) Цикл
		СтрокаЗамены = СтрокаЗамены + "@";
	КонецЦикла;
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтрЗаменить(СтрокаДляРазбора,СтрокаПоиска,СтрокаЗамены+"_"+СтрокаЗамены),СтрокаЗамены);
	ФормСтрока = Новый Массив;
	Для каждого СтрокаИзМассива Из МассивСтрок Цикл
		Если СтрокаИзМассива = "_" Тогда
			ФормСтрока.Добавить(Новый ФорматированнаяСтрока(СтрокаПоиска,Новый Шрифт(,,Истина),WebЦвета.ЗеленыйЛес));
		Иначе
			ФормСтрока.Добавить(Новый ФорматированнаяСтрока(СтрокаИзМассива))
		КонецЕсли;
	КонецЦикла;
	Возврат Новый ФорматированнаяСтрока(ФормСтрока); 
	
КонецФункции
